FunMod/DAB-500W-CCS/c2000.syscfg
epwm5.$hardware                                                = system.deviceData.board.components.PWM_LOC5;
epwm5.epwmTimebase_hsClockDiv                                  = "EPWM_HSCLOCK_DIVIDER_1";
epwm5.epwmTimebase_period                                      = 3;
epwm5.epwmCounterCompare_cmpA                                  = 3;
epwm5.epwmCounterCompare_cmpB                                  = 3;
epwm5.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_ZERO    = "EPWM_AQ_OUTPUT_LOW";
epwm5.epwmDeadband_enableRED                                   = true;
epwm5.epwmDeadband_enableFED                                   = true;
epwm5.epwmTimebase_emulationMode                               = "EPWM_EMULATION_FREE_RUN";
epwm5.epwmTimebase_counterMode                                 = "EPWM_COUNTER_MODE_UP_DOWN";
epwm5.epwmTimebase_syncInPulseSource                           = "EPWM_SYNC_IN_PULSE_SRC_DISABLE";
epwm5.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA = "EPWM_AQ_OUTPUT_HIGH";
epwm5.epwmTimebase_syncOutPulseMode                            = ["EPWM_SYNC_OUT_PULSE_ON_CNTR_ZERO"];
epwm5.$name                                                    = "SDFM1_CLK";

epwm6.$hardware                                         = system.deviceData.board.components.PWM_LOC8;
epwm6.epwmTimebase_emulationMode                        = "EPWM_EMULATION_FREE_RUN";
epwm6.epwmTimebase_hsClockDiv                           = "EPWM_HSCLOCK_DIVIDER_1";
epwm6.epwmTimebase_counterMode                          = "EPWM_COUNTER_MODE_UP_DOWN";
epwm6.$name                                             = "Current_Balancing";
epwm6.epwmEventTrigger_EPWM_SOC_A_triggerEnable         = true;
epwm6.epwmEventTrigger_EPWM_SOC_A_triggerEventPrescalar = "1";
epwm6.epwmTimebase_period                               = 600;
epwm6.epwmEventTrigger_EPWM_SOC_B_triggerEnable         = true;
epwm6.epwmEventTrigger_EPWM_SOC_B_triggerEventPrescalar = "1";
epwm6.epwmCounterCompare_cmpA                           = 300;
epwm6.epwmCounterCompare_cmpB                           = 300;
epwm6.epwmTimebase_phaseEnable                          = true;
epwm6.epwmCounterCompare_cmpC                           = 420;
epwm6.epwmCounterCompare_cmpD                           = 180;
epwm6.epwmEventTrigger_EPWM_SOC_A_triggerSource         = "EPWM_SOC_TBCTR_U_CMPA";
epwm6.epwmEventTrigger_EPWM_SOC_B_triggerSource         = "EPWM_SOC_TBCTR_D_CMPB";
epwm6.epwmTimebase_phaseShift                           = 400;
epwm6.epwm.$assign                                      = "EPWM8";

epwm7.epwmTimebase_hsClockDiv                                  = "EPWM_HSCLOCK_DIVIDER_1";
epwm7.epwmTimebase_period                                      = 3;
epwm7.epwmTimebase_counterMode                                 = "EPWM_COUNTER_MODE_UP_DOWN";
epwm7.epwmTimebase_emulationMode                               = "EPWM_EMULATION_FREE_RUN";
epwm7.$hardware                                                = system.deviceData.board.components.PWM_LOC6;
epwm7.epwmCounterCompare_cmpA                                  = 3;
epwm7.epwmCounterCompare_cmpB                                  = 3;
epwm7.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_ZERO    = "EPWM_AQ_OUTPUT_LOW";
epwm7.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA = "EPWM_AQ_OUTPUT_HIGH";
epwm7.epwmDeadband_polarityFED                                 = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm7.epwmDeadband_enableRED                                   = true;
epwm7.epwmDeadband_enableFED                                   = true;
epwm7.epwmTimebase_syncInPulseSource                           = "EPWM_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM5";
epwm7.epwmTimebase_phaseEnable                                 = true;
epwm7.epwmTimebase_phaseShift                                  = 1;
epwm7.$name                                                    = "SDFM2_CLK";

epwm8.epwmTimebase_hsClockDiv              = "EPWM_HSCLOCK_DIVIDER_1";
epwm8.epwmTimebase_counterMode             = "EPWM_COUNTER_MODE_UP_DOWN";
epwm8.epwmTimebase_period                  = 1200;
epwm8.epwmEventTrigger_enableInterrupt     = true;
epwm8.epwmEventTrigger_registerInterrupts  = true;
epwm8.epwmTimebase_phaseEnable             = true;
epwm8.$name                                = "Refgen_Task";
epwm8.epwmEventTrigger_interruptEventCount = "2";
epwm8.epwmEventTrigger_interruptSource     = "EPWM_INT_TBCTR_ZERO";
epwm8.epwmTimebase_phaseShift              = 750;
epwm8.epwm.$assign                         = "EPWM7";
epwm8.epwm.epwm_aPin.$assign               = "hsecDigital.58";
epwm8.epwm.epwm_bPin.$assign               = "hsecDigital.60";
epwm8.epwmInt.enableInterrupt              = true;
scripting.suppress("Connected to hardware,@@@.+?@@@ is connected to FSI Header on the Control Card F280039C\\. Consider selecting it in \'use hardware\' above\\. @@@.+?@@@", epwm8.epwm, "epwm_aPin");
scripting.suppress("Connected to hardware,@@@.+?@@@ is connected to FSI Header on the Control Card F280039C\\. Consider selecting it in \'use hardware\' above\\. @@@.+?@@@", epwm8.epwm, "epwm_bPin");

gpio1.$name             = "myGPIO0";
gpio1.writeInitialValue = true;
gpio1.initialValue      = 1;
gpio1.direction         = "GPIO_DIR_MODE_OUT";
gpio1.gpioPin.$assign   = "hsecDigital.82";
scripting.suppress("Connected to hardware,@@@.+?@@@ is connected to CANA on the Control Card F280039C\\. Consider selecting it in \'use hardware\' above\\. @@@.+?@@@", gpio1, "gpioPin");

gpio2.direction         = "GPIO_DIR_MODE_OUT";
gpio2.controllerCore    = "GPIO_CORE_CPU1_CLA1";
gpio2.$name             = "TEST_IO";
gpio2.writeInitialValue = true;
gpio2.initialValue      = 1;
gpio2.gpioPin.$assign   = "hsecDigital.91";

gpio3.direction         = "GPIO_DIR_MODE_OUT";
gpio3.writeInitialValue = true;
gpio3.initialValue      = 1;
gpio3.$name             = "TEST_IO1";
gpio3.gpioPin.$assign   = "hsecDigital.93";

gpio4.direction         = "GPIO_DIR_MODE_OUT";
gpio4.writeInitialValue = true;
gpio4.initialValue      = 1;
gpio4.$name             = "TEST_IO2";
gpio4.gpioPin.$assign   = "hsecDigital.95";

